DataProcessors/фин_ЗаполнениеКонтролируемыхФинансовыхПоказателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>фин_ЗаполнениеКонтролируемыхФинансовыхПоказателей</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтклоненияКонтролируемыхЗначений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_ВидыОтклоненийКонтролируемыхЗначенийБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отклонение</Name>
					<Comment>Отклонение от значения контролирующего сценария</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоризонтПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойВыборПериода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РазрезыУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Измерение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_ФактическиеПоказателиБюджетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрез</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.фин_ВидыСубконтоБюджетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/фин_НастройкиРегулярногоКонтроляПоказателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>фин_НастройкиРегулярногоКонтроляПоказателей</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидКонтроля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_ВидыКонтролируемогоЗначенияБюджета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидОтклоненияКонтролируемыхЗначений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_ВидыОтклоненийКонтролируемыхЗначенийБюджетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отклонение</Name>
					<Comment>Отклонение</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Разрез1</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Разрез10</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Разрез2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Разрез3</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Разрез4</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Разрез5</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Разрез6</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Разрез7</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Разрез8</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Разрез9</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УправленческоеПодразделение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименятьКонтроль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФинансовыйПоказатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_ФинансовыеПоказатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИспользованиеКонтролируемыхЗначений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_ИспользованиеКонтролируемыхЗначенийБюджетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/фин_ОборотыБюджетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>фин_ОборотыБюджетов</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСценария</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УдалитьШаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Удалить_фин_ШаблоныОтраженияДанныхРегистровПоБюджетам</v8:Type>
						<v8:Type>cfg:CatalogRef.Удалить_фин_ШаблоныОтраженияФактическихДанныхПоБюджетам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКомментарийШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиИсточника</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВложеннаяЗависимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПроводок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_ШаблоныПроводокПоСчетамБюджетирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_ВидыОтраженийПервичныхДокументовВБюджетировании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИдентификаторПравила</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Правило</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_ПравилаОтраженияФактическихДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Схема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_СхемыОтраженияФактическихДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичныйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФинансовыйПоказатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_ФинансовыеПоказатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПланирования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.фин_Бюджет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УправленческоеПодразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.фин_СправочникУправленческихПодразделений</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.фин_СправочникПроектов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.фин_СправочникиНоменклатурныхСписков</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДополнительныеРазрезы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_КлассификаторНаборовДополнительныхРазрезов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/фин_ВидыОграниченийОборотовБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>фин_ВидыОграниченийОборотовБюджета</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПредварительныйБюджет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтролирующийСценарийПоВсем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтролирующийСценарийВыборочно</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/фин_ВидыОтклоненийКонтролируемыхЗначенийБюджетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>фин_ВидыОтклоненийКонтролируемыхЗначенийБюджетов</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Абсолютное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Относительное</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/фин_ВидыФинансовыхПоказателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>фин_ВидыФинансовыхПоказателей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оборотный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьОстаточный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассчитываемый</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/фин_ЗаполнениеКонтролируемыхФинансовыхПоказателей/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДеревоЗаполнения = ДанныеФормыВЗначение(Дерево,Тип("ДеревоЗначений"));
    ЗаполнитьУзел(Неопределено,ДеревоЗаполнения);
	ЗначениеВДанныеФормы(ДеревоЗаполнения,Дерево);
	фин_РаботаСДополнительнымиРазрезамиБюджетирования.НастроитьПредставлениеРазрезов(ЭтотОбъект,,,Ложь);
	фин_РаботаСДополнительнымиРазрезамиБюджетирования.ЗаполнитьСписокРазрезовУчета(СписокРазрезов);
	НадписьБюджетыИСтатьиБюджетов = "Бюджеты и статьи бюджетов";
	НадписьРазрезыКонтроля = "Разрезы контроля";
	Если НЕ Параметры.Свойство("Сценарий") Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Форма не предназначена для самостоятельной работы");
		Возврат;
	КонецЕсли;
	Сценарий = Параметры.Сценарий;
	Организация = Параметры.Организация;
	Адрес = Параметры.Адрес;
	ИспользованиеКонтролируемыхЗначений = Параметры.ИспользованиеКонтролируемыхЗначений;
	Элементы.ГруппаОтклонение.Видимость = НЕ (Параметры.ВидОграниченияОборотов = Перечисления.фин_ВидыОграниченийОборотовБюджета.ПредварительныйБюджет);
	Предварительный =  Параметры.ВидОграниченияОборотов = Перечисления.фин_ВидыОграниченийОборотовБюджета.ПредварительныйБюджет;
	Объект.ВидОтклоненияКонтролируемыхЗначений = Перечисления.фин_ВидыОтклоненийКонтролируемыхЗначенийБюджетов.Относительное;
  	Объект.ПериодПланирования = фин_ПроцедурыМеханизмовБюджетированияКлиентСервер.ДатаНачалаПериода(ТекущаяДата(),Сценарий);
	фин_ПроцедурыМеханизмовБюджетированияКлиентСервер.УстановитьГоризонтПланированияИПредставлениеБюджетногоПериода(НадписьПериодПланирования,,Объект.ПериодПланирования,Сценарий);
КонецПроцедуры

//Процедура заполняет дерево значений 
//
Процедура ЗаполнитьУзел(Строка,ДеревоЗаполнения)	
	СтрокиДерева = ДеревоЗаполнения.Строки;
	Флаг = 0;
    Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИспользованиеКонтролируемыхЗначений",ИспользованиеКонтролируемыхЗначений);
    Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
                   |	СтатьиБюджета.Ссылка КАК СтатьяБюджета,
                   |	СтатьиБюджета.Владелец КАК Бюджет,
                   |	СтатьиБюджета.ЭтоГруппа,
                   |	СтатьиБюджета.Родитель
                   |ИЗ
                   |	Справочник.фин_СтатьиБюджета КАК СтатьиБюджета
                   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.фин_НастройкиРегулярногоКонтроляПоказателей.СрезПоследних(, ИспользованиеКонтролируемыхЗначений = &ИспользованиеКонтролируемыхЗначений) КАК НастройкиРегулярногоКонтроля
                   |		ПО СтатьиБюджета.ФинансовыйПоказатель = НастройкиРегулярногоКонтроля.ФинансовыйПоказатель
                   |ГДЕ
                   |	СтатьиБюджета.ЭтоГруппа = ЛОЖЬ
                   |	И СтатьиБюджета.ФинансовыйПоказатель.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.фин_ВидыФинансовыхПоказателей.Оборотный)
                   |	И ЕСТЬNULL(НастройкиРегулярногоКонтроля.ПрименятьКонтроль, ЛОЖЬ) = ЛОЖЬ
                   |
                   |СГРУППИРОВАТЬ ПО
                   |	СтатьиБюджета.Ссылка,
                   |	СтатьиБюджета.Владелец,
                   |	СтатьиБюджета.ЭтоГруппа,
                   |	СтатьиБюджета.Родитель
                   |ИТОГИ ПО
                   |	Бюджет,
                   |	СтатьяБюджета ИЕРАРХИЯ";
    Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Если Выборка.Количество() <> 0 Тогда
		СтрокиДерева.Очистить();
		Пока Выборка.Следующий() Цикл
			СтрокаДерева = СтрокиДерева.Добавить();
            СтрокаДерева.СтатьяБюджета = Выборка.Бюджет;
            СтрокаДерева.Флаг = Флаг;
			ПодВыборка = Выборка.Выбрать();
			Пока ПодВыборка.Следующий() Цикл
				Если ПодВыборка.ТипЗаписи() = ТипЗаписиЗапроса.ИтогПоГруппировке Тогда
					Продолжить;
				КонецЕсли;			
				Строка = ДеревоЗаполнения.Строки.Найти(ПодВыборка.Родитель,"СтатьяБюджета",Истина);
				Если Строка = Неопределено Тогда
					Строка = ДеревоЗаполнения.Строки.Найти(ПодВыборка.Бюджет,"СтатьяБюджета");
				КонецЕсли;			
				СтрокаДерева = Строка.Строки.Добавить();				
			  	СтрокаДерева.СтатьяБюджета = ПодВыборка.СтатьяБюджета;
            	СтрокаДерева.Флаг = Флаг;						
			КонецЦикла;						
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РазрезыУчетаИзмерениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = СписокРазрезов;
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	ДеревоЗаполнения = ДанныеФормыВЗначение(Дерево,Тип("ДеревоЗначений"));
    ЗаполнитьУзел(Неопределено,ДеревоЗаполнения);
	ЗначениеВДанныеФормы(ДеревоЗаполнения,Дерево);
КонецПроцедуры

&НаКлиенте
Процедура ДеревоФлагПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Дерево.ТекущиеДанные;
	Если ТекущиеДанные.Флаг = 2 Тогда
		ТекущиеДанные.Флаг = 0;
	КонецЕсли;	
	Если ТекущиеДанные.Флаг = 0 Тогда
		Если ТекущиеДанные.ПолучитьЭлементы().Количество()>0 Тогда
			УстановитьФлагПодСтрокам(ТекущиеДанные.ПолучитьЭлементы(),0)	
		КонецЕсли;
		Если НЕ ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
			ПроверитьФлагиПодчиненныхСтрок(ТекущиеДанные.ПолучитьРодителя().ПолучитьЭлементы(),0);
		КонецЕсли;		
	ИначеЕсли ТекущиеДанные.Флаг = 1 Тогда
		Если ТекущиеДанные.ПолучитьЭлементы().Количество()>0 Тогда
			УстановитьФлагПодСтрокам(ТекущиеДанные.ПолучитьЭлементы(),1)	
		КонецЕсли;
        Если НЕ ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
			ПроверитьФлагиПодчиненныхСтрок(ТекущиеДанные.ПолучитьРодителя().ПолучитьЭлементы(),1);
		КонецЕсли; 	
	КонецЕсли;	
КонецПроцедуры

//Процедура устанавливает значение флага подчиненным строкам дерева
//
&НаКлиенте
Процедура УстановитьФлагПодСтрокам(Строки,Флаг)
	Для Каждого Строка Из Строки Цикл
		Строка.Флаг = Флаг;
		Если Строка.ПолучитьЭлементы().Количество()>0 Тогда
			УстановитьФлагПодСтрокам(Строка.ПолучитьЭлементы(),Флаг)	
		КонецЕсли;
	КонецЦикла;;	
КонецПроцедуры //УстановитьФлагПодСтрокам

//Процедура контролирует значение флага у родительских строк
//
&НаКлиенте
Процедура ПроверитьФлагиПодчиненныхСтрок(Строки,ФлагПроверки)
	Флаг = Ложь;
	Если ФлагПроверки = 2 Тогда
		РодСтрока = Строки[0].ПолучитьРодителя();
		РодСтрока.Флаг = 2;
		Если НЕ РодСтрока.ПолучитьРодителя() = Неопределено Тогда
			ПроверитьФлагиПодчиненныхСтрок(РодСтрока.ПолучитьРодителя().ПолучитьЭлементы(),РодСтрока.Флаг);
		КонецЕсли;
	Иначе	
		Для Каждого Строка Из Строки Цикл 
			Если НЕ Строка.Флаг = ФлагПроверки Тогда 
				Флаг = Истина;
				Прервать;
			КонецЕсли;			
		КонецЦикла;
		РодСтрока = Строка.ПолучитьРодителя();
		Если ФлагПроверки = 0 И Флаг Тогда			
			РодСтрока.Флаг = 2;
		ИначеЕсли ФлагПроверки = 0 И НЕ Флаг Тогда
			РодСтрока.Флаг = 0;
		ИначеЕсли ФлагПроверки = 1 И Флаг Тогда
			РодСтрока.Флаг = 2;
		ИначеЕсли ФлагПроверки = 1 И НЕ Флаг Тогда
			РодСтрока.Флаг = 1;
		КонецЕсли;
		Если НЕ РодСтрока.ПолучитьРодителя() = Неопределено Тогда
			ПроверитьФлагиПодчиненныхСтрок(РодСтрока.ПолучитьРодителя().ПолучитьЭлементы(),РодСтрока.Флаг);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры //ПроверитьФлагиПодчиненныхСтрок

&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
	Закрыть(ВыполнитьНаСервере());
КонецПроцедуры

//Процедура формирует список установленных пользователем соответствий
//
Процедура СформироватьСписокСоответствий(СписокСоответствий,Строки)
	Для Каждого Строка Из Строки Цикл 
		Если Строка.Флаг = 1 И Строка.Родитель <> Неопределено Тогда
			СписокСоответствий.Добавить(Строка.СтатьяБюджета);		
		КонецЕсли;		
		Если Строка.Строки.Количество()>0 Тогда
			СформироватьСписокСоответствий(СписокСоответствий,Строка.Строки);
		КонецЕсли;		
	КонецЦикла;	
КонецПроцедуры //СформироватьСписокСоответствий

&НаСервере
Функция ВыполнитьНаСервере()
	ДеревоЗаполнения = ДанныеФормыВЗначение(Дерево,Тип("ДеревоЗначений"));
	СписокСоответствий = Новый Массив;	
	СформироватьСписокСоответствий(СписокСоответствий,ДеревоЗаполнения.Строки);	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтатьиБюджета.ФинансовыйПоказатель
	               |ПОМЕСТИТЬ ВТ_Статьи
	               |ИЗ
	               |	Справочник.фин_СтатьиБюджета КАК СтатьиБюджета
	               |ГДЕ
	               |	СтатьиБюджета.Ссылка В(&Ссылки)
	               |	И СтатьиБюджета.ЭтоГруппа = ЛОЖЬ";
	Запрос.УстановитьПараметр("Ссылки",СписокСоответствий);
	Запрос.Выполнить();	
	Запрос2 = Новый Запрос;
	Запрос2.МенеджерВременныхТаблиц = МенеджерВТ;
	ЗАпрос2.Текст = "ВЫБРАТЬ
	                |						ВТ_Статьи.ФинансовыйПоказатель
	                |					ИЗ
	                |						ВТ_Статьи";
	ТЗ = Запрос2.Выполнить().Выгрузить();
	Запрос1 = Новый Запрос;
	ТекстГруппировки = "";
	Запрос1.МенеджерВременныхТаблиц = МенеджерВТ;
	Текст = "ВЫБРАТЬ
	      |	&Отклонение КАК Отклонение,
	      |	ОборотыБюджетовОбороты.ФинансовыйПоказатель,
		  | ОборотыБюджетовОбороты.ПериодПланирования КАК Период";
	ТекстГруппировки = "
		|	СГРУППИРОВАТЬ ПО
		|	ОборотыБюджетовОбороты.ФинансовыйПоказатель,
		|	ОборотыБюджетовОбороты.ПериодПланирования";
	Для Каждого РазрезЭлемент Из фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("ПолучитьПолныйСписокРазрезов") Цикл
		Если Объект.РазрезыУчета.НайтиСтроки(Новый Структура("Измерение",РазрезЭлемент.Значение)).Количество()>0 Тогда
			ИмяРазреза = фин_РаботаСДополнительнымиРазрезамиБюджетирования.ИмяРазреза(РазрезЭлемент.Значение);
			Текст = Текст + ",
		    |	ОборотыБюджетовОбороты."+?(Найти(ИмяРазреза,"Разрез")=0,"","ДополнительныеРазрезы.")+ИмяРазреза+" КАК "+ИмяРазреза;
			ТекстГруппировки = ТекстГруппировки + ",
		    |	ОборотыБюджетовОбороты."+?(Найти(ИмяРазреза,"Разрез")=0,"","ДополнительныеРазрезы.")+ИмяРазреза;
		КонецЕсли;
	КонецЦикла;
	Условие = "";
	Если фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("фин_БюджетированиеПоОрганизациям") Тогда
		Условие = " Организация = &Организация И ";
		Запрос1.УстановитьПараметр("Организация", Организация);
	КонецЕсли;
	Если Предварительный Тогда
		Текст = Текст +",
	    |	СУММА(ЕстьNull(ОборотыБюджетовОбороты.СуммаСценарияОборот,0)) КАК СуммаСценарияКонтроль";		
	Иначе
		Текст = Текст +",
	    |	&ВидОтклонения КАК ВидОтклоненияКонтролируемыхЗначений ";
    	Запрос1.УстановитьПараметр("ВидОтклонения",Объект.ВидОтклоненияКонтролируемыхЗначений);
	КонецЕсли;	
	Текст = Текст +"
	                |ИЗ 
	                |	РегистрНакопления.фин_ОборотыБюджетов.Обороты(
	                |			,
	                |			,
	                |			"+фин_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьПериодичностьСценария(Сценарий)+", ПериодПланирования>=&НачалоПериода И ПериодПланирования<=&КонецПериода И
					|			Сценарий = &Сценарий
	                |				И "+Условие+"
	                |				ФинансовыйПоказатель В
	                |					(ВЫБРАТЬ
	                |						ВТ_Статьи.ФинансовыйПоказатель
	                |					ИЗ
	                |						ВТ_Статьи)) КАК ОборотыБюджетовОбороты  "+ТекстГруппировки;
	Запрос1.Текст = Текст;
	Запрос1.УстановитьПараметр("Сценарий",Сценарий);
	Запрос1.УстановитьПараметр("Отклонение",Объект.Отклонение);
	НачалоПериода = фин_ПроцедурыМеханизмовБюджетированияКлиентСервер.ДатаНачалаПериода(Объект.ПериодПланирования,фин_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьПериодичностьСценария(Сценарий));
	Если Объект.РучнойВыборПериода Тогда
		КонецПериода = Объект.ГоризонтПланирования;
	Иначе
		КонецПериода  = ?(Сценарий.ПродолжительностьЦикла<2,фин_ПроцедурыМеханизмовБюджетированияКлиентСервер.ДатаКонцаПериода(Объект.ПериодПланирования,фин_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьПериодичностьСценария(Сценарий)),фин_ПроцедурыМеханизмовБюджетированияКлиентСервер.ДобавитьИнтервал(фин_ПроцедурыМеханизмовБюджетированияКлиентСервер.ДатаКонцаПериода(Объект.ПериодПланирования,фин_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьПериодичностьСценария(Сценарий)),фин_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьПериодичностьСценария(Сценарий),Сценарий.ПродолжительностьЦикла-1));
	КонецЕсли;
	Запрос1.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос1.УстановитьПараметр("КонецПериода",  КонецПериода );
	НачалоКонцаПериода = фин_ПроцедурыМеханизмовБюджетированияКлиентСервер.ДатаНачалаПериода(КонецПериода,фин_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьПериодичностьСценария(Сценарий));
	Выборка = Запрос1.Выполнить().Выгрузить();	
	Если Предварительный Тогда 
		Для Каждого СтатьяБюджета Из ТЗ Цикл
			Период = НачалоПериода;
			Пока Период <= НачалоКонцаПериода Цикл 
				Отбор = Новый Структура;
				Отбор.Вставить("ФинансовыйПоказатель",СтатьяБюджета.ФинансовыйПоказатель);
				Отбор.Вставить("Период",Период);
				Строки = Выборка.НайтиСтроки(Отбор);
				Если Строки.Количество() = 0 Тогда
					СтрВыборки = Выборка.Добавить();	
					СтрВыборки.Период = Период;
					СтрВыборки.ФинансовыйПоказатель = СтатьяБюджета.ФинансовыйПоказатель;
					СтрВыборки.СуммаСценарияКонтроль = 0;
				КонецЕсли;
				Период = фин_ПроцедурыМеханизмовБюджетированияКлиентСервер.ДобавитьИнтервал(фин_ПроцедурыМеханизмовБюджетированияКлиентСервер.ДатаНачалаПериода(Период,фин_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьПериодичностьСценария(Сценарий)),фин_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьПериодичностьСценария(Сценарий),1);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	Выборка.Сортировать("Период возр, ФинансовыйПоказатель возр");
	Возврат ПоместитьВоВременноеХранилище(Выборка,Адрес);
	
КонецФункции


&НаКлиенте
Процедура НадписьПериодПланированияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораПериодаПланирования",ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.фин_ВыборБюджетногоПериода",Новый Структура("НачалоПериодаПланирования,КонецПериодаПланирования,Периодичность,РазрешитьПроизвольныйПериод",Объект.ПериодПланирования,Объект.ГоризонтПланирования,Сценарий,Истина),ЭтотОбъект,УникальныйИдентификатор,ВариантОткрытияОкна.ОтдельноеОкно,,ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПериодаПланирования(РезультатВыбора,ДополнительныеПараметры) Экспорт
	Если РезультатВыбора<>Неопределено Тогда
		Объект.ПериодПланирования 	= РезультатВыбора.НачалоПериода;
		Объект.ГоризонтПланирования = РезультатВыбора.КонецПериода;
		фин_УправлениеОтчетамиКлиентСервер.УстановитьТекстПериодаПоВыбраннойПериодичности(НадписьПериодПланирования,Сценарий,Объект.ПериодПланирования,Объект.ГоризонтПланирования,Ложь);
	КонецЕсли;
КонецПроцедуры
